tutorials/2206/hisDriftFluxFoam/SemiZeroGapCellCase/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1e-3;



Ny		90.0;//n cell in y normal
Nz		1; //n cell in z normal
tcPe		2;//flow channel size, at the positive electrode
tPe		1.8; //Positive electrode thickness
tDi		0.85; //Diaframe thickness
tNe		1.8; //Negative electrode thickness
tcNe		2;//flow channel size, at the Negative electrode

cellLength	30.0;
cellDepth	30;

S1 4.0;
SDi	2;

t1 #eval #{ $tPe+$tcPe #};
t2 #eval #{ $t1+$tDi #};
t3 #eval #{ $t2+$tNe #};
t4 #eval #{ $t3+$tcNe #};

dyPe	6.37345514017;
dyNe	6.37345514017;

dyDiNe	1.92027451324;	
dyDiPe	1.92027451324;

dx	4;


Nx  #eval #{ round($cellLength/($t3*$S1) *$Ny) #};

NyPEc #eval #{ round($tcPe/($t4)*$Ny) #};
NyPE #eval #{ round($tPe/($t4)*$Ny) #};
NyNE #eval #{ round($tNe/($t4)*$Ny) #};
NyNEc #eval #{ round($tNe/($t4)*$Ny) #};
NyD #eval #{ round($tDi/($t4)*$Ny*$SDi) #};

vertices
(
//origin plane
    (0			0		0)		//0
    ($cellLength	0		0)		//1
    (0			0		$cellDepth)	//2
    ($cellLength	0		$cellDepth)	//3
//positiveElectrode and flowchannel interface plane
    (0 			$tcPe 		0)   		//4
    ($cellLength 	$tcPe 		0)		//5
    (0 			$tcPe 		$cellDepth)	//6
    ($cellLength 	$tcPe 		$cellDepth)	//7
//positiveElectrode and diaphrame interface plane
    (0		 	$t1 		0)		//8
    ($cellLength	$t1		0)		//9
    (0		 	$t1 		$cellDepth)	//10
    ($cellLength	$t1 		$cellDepth)	//11
//NegativeElectrode and diaphrame interface plane   
    (0 			$t2		0)   		//12
    ($cellLength 	$t2 		0)		//13
    (0	 		$t2  		$cellDepth)	//14
    ($cellLength	$t2		$cellDepth)	//15
//negativeElectrode and flowchannel interface plane
    (0 			$t3		0)		//16
    ($cellLength 	$t3 		0)		//17
    (0	 		$t3 		$cellDepth)	//18
    ($cellLength 	$t3 		$cellDepth)	//19
// flow channel wall.
    (0 			$t4		0)		//20
    ($cellLength 	$t4 		0)		//21
    (0	 		$t4 		$cellDepth)	//22
    ($cellLength 	$t4 		$cellDepth)	//23

);

blocks
(
	hex (0 1 5 4 2 3 7 6) 		flowChannel		($Nx $NyPEc $Nz) 	simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyPe)(0.5 0.5 #eval #{ 1/$dyPe #}))  1)
	hex (4 5 9 8 6 7 11 10) 	positiveElectode 	($Nx $NyPE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyPe)(0.5 0.5 #eval #{ 1/$dyPe #}))  1)
	hex (8 9 13 12 10 11 15 14) 	diaphram 		($Nx $NyD $Nz) 	simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyDiPe)(0.5 0.5 #eval #{ 1/$dyDiNe #}))  1)
	hex (12 13 17 16 14 15 19 18) 	negativeElectode	($Nx $NyNE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyNe)(0.5 0.5 #eval #{ 1/$dyNe #}))  1)
	hex (16 17 21 20 18 19 23 22) 	flowChannel		($Nx $NyPEc $Nz) 	simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyNe)(0.5 0.5 #eval #{ 1/$dyNe #}))  1)
    //hex (0 1 2 3 4 5 6 7) 	positiveElectode 	($Nx $NyPE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyPe)(0.5 0.5 #eval #{ 1/$dyPe #}))  1)
    //hex (3 2 9 8 7 6 11 10) 	diaphram 		($Nx $NyD $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyDiPe)(0.5 0.5 #eval #{ 1/$dyDiNe #}))  1)
    //hex (8 9 13 12 10 11 15 14) negativeElectode 	($Nx $NyNE $Nz) simpleGrading (((0.5 0.5 $dx)(0.5 0.5 #eval #{ 1/$dx #})) ((0.5 0.5 $dyNe)(0.5 0.5 #eval #{ 1/$dyNe #}))  1)
    
);
//x - ((0.1 0.15 4)(0.8 0.7 1)(0.1 0.15 0.25))
//y - ((0.2 0.3 4)(0.6 0.4 1)(0.2 0.3 0.25)) 
edges
(
);

boundary
(

    Wall
    {
	type wall;
	faces
	(
	    (8 10 14 12)
	    (9 11 15 13)
	    
	    (0 2 3 1)
	    (20 22 23 21)
	    //(8 9 13 12)
	    //(10 11 15 14)
	);
    }
    PNe
    {
        type wall;
        faces
        (
            (12 14 18 16)
            //(12 13 17 16)
            //(14 15 19 18)
        );
    }
    PPe
    {
        type wall;
        faces
        (
            (4 6 10 8)
            //(4 5 9 8)
            //(6 7 11 10)
        );
    }
    Inlet
    {
        type patch;
        faces
        (
            (0 2 6 4)
            (16 18 22 20)
            
        );
    }
    Outlet
    {
        type patch;
        faces
        (
            
            (1 3 7 5)
            (17 19 23 21)
            //(2 3 7 6)
            //(18 19 23 22)
            (13 15 19 17) //in porous region
            (5 7 11 9) // in porous region
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            //inlet side
            (0 1 5 4)
            (4 5 9 8)
            (8 9 13 12)
            (12 13 17 16)
            (16 17 21 20)
            
            //(0 2 6 4)
            //(4 6 10 8)
            //(8 10 14 12)
            //(12 14 18 16)
            //(16 18 22 20)
            //outlet side
            (2 3 7 6)
            (6 7 11 10)
            (10 11 15 14)
            (14 15 19 18)
            (18 19 23 22)
            
            //(1 3 7 5)
            //(5 7 11 9)
            //(9 11 15 13)
            //(13 15 19 17)
            //(17 19 23 21)
            
        );
    }
);


// ************************************************************************* //
