tutorials/2206/hisDriftFluxFoam/SemiZeroGapCellCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    Wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          246;
        startFace       20377;
    }
    PNe
    {
        type            wall;
        inGroups        1(wall);
        nFaces          19;
        startFace       20623;
    }
    PPe
    {
        type            wall;
        inGroups        1(wall);
        nFaces          19;
        startFace       20642;
    }
    Inlet
    {
        type            patch;
        nFaces          42;
        startFace       20661;
    }
    Outlet
    {
        type            patch;
        nFaces          80;
        startFace       20703;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          20580;
        startFace       20783;
    }
)

// ************************************************************************* //
