tutorials/2206/hisDriftFluxFoam/SemiZeroGapCellCase/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.00309 0 0);//200ml/min


boundaryField
{
    PNe
    {
        type            noSlip;
    }
    PPe
    {
        type            noSlip;
    }
    frontAndBack
    {
	type		empty;
    }
    Inlet
    {
    	//type	zeroGradient;
        type            fixedValue;
        value		$internalField;
        //type	flowRateInletVelocity;
        //volumetricFlowRate constant 0.833e-6;
        //type 			fixedMean;
        //meanValue		constant (VEX VEY VEZ);
        //value			$internalField;
    }

    Outlet
    {
        type            zeroGradient;
    }

    Wall
    {
            type            noSlip;
    	//type	zeroGradient;
        //type            fixedValue;
        //value		$internalField;
        //type	flowRateInletVelocity;
        //volumetricFlowRate constant 1e-4;
    }
    
}


// ************************************************************************* //
