tutorials/2206/hisDriftFluxFoam/SemiZeroGapCellCase/0.orig/NeC
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      NeC;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0; 


boundaryField
{
    PNe
    {
        type            zeroGradient;
    }
    PPe
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    Outlet
    {
        type            zeroGradient;
    }

    Inlet
    {
        type            zeroGradient;
    }

    Wall
    {
	type 		zeroGradient;
    }
    
}


// ************************************************************************* //
