tutorials/2206/hisDriftFluxFoam/SemiZeroGapCellCase/0.orig/UNe
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      UNe;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform -1.4;



boundaryField
{
    PNe
    {
        type            uniformFixedValue;
        uniformValue 	table
        (
        (0 -1.4)
	(25 -1.4)(37.5 -1.5)(50 -1.5)(62.5 -1.6)(75 -1.6)(87.5 -1.7)(100 -1.7)(112.5 -1.8)(125 -1.8)(137.5 -1.9)(150 -1.9)(162.5 -2.0)(175 -2.0)
        );
    }
    PPe
    {
	type		zeroGradient;
    }

    frontAndBack
    {
	type		empty;
    }
    Inlet
    {
    	type		zeroGradient;
    }

    Outlet
    {
        type            zeroGradient;
    }

    Wall
    {
	type 		zeroGradient;
    }
    
}


// ************************************************************************* //
