tutorials/2206/hisDriftFluxFoam/SemiZeroGapCellCase/0.orig/Ue
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ue;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform -0.42;

boundaryField
{
    PNe
    {
	type		zeroGradient;
    }
    PPe
    {
	type		zeroGradient;
    }

    frontAndBack
    {
	type		empty;
    }
    Inlet
    {
    	type		zeroGradient;
    }


    Outlet
    {
        type            zeroGradient;
    }

    Wall
    {
	type 		zeroGradient;
    }
    
}


// ************************************************************************* //
